/**
 * 
 * 前端的框架一共有三个:
 * 1.AngularJS(2009年)----Misko Hevery(米斯科·赫维尔)--目前由谷歌维护
 * 2.Vue(2014年2月)------尤雨溪------目前github----164k
 * 3.React(2013年发布)----facebook----目前github---->149k
 *  Vue和React的分量(看github的搜索)
 * 
 * 
 * 1. Vue是什么？
 *  Vue是一个渐进式的JavaScript框架
 *  渐进式的解释: 所谓的渐进式,就是Vue本身实现的功能是有限的,但是相关的插件有很多,只要安装或者引入使用即可完成更多的功能
 *  举例: 一台拖拉机的功能是有限的,但是它有很多的工具(翻地的工具,拉货的车厢,载人的车斗)
 *        拖拉机就是Vue,其他的工具就是插件或者相关的包
 * 
 * 
 * Vue的课程的安排：
 * 1.Vue的基础(基础的语法和源码的分析)-----6天----7天或者8天----看大家的接受和理解的能力---学习stylus---CSS预编译
 * 2.电商前台项目---10天(Vue的高级的内容)
 * 3.电商后台项目---7天(Vue的高级的内容)
 * 4.总结Vue的面试题
 * 
 * Vue.js 不支持 IE8 及其以下版本，因为 Vue.js 使用的 ECMAScript 5 特性在 IE8 无法模拟。Vue.js 支持所有兼容 ECMAScript 5 的浏览器
 * 
 * 2. Vue的使用三种方式:
 *  1) 通过CDN在线引入----第一个文件演示
 *  2) 通过本地引入vue.js的方式---脚手架之前演示
 *  3) 通过下载脚手架的方式(脚手架2要熟练使用,脚手架3要熟练使用)----重点
 * 3. Vue的基本语法:
 *  1) 模版语法:
 *  2) 条件指令
 *  3) 数据绑定指令
 *  4) 事件指令
 *  5) 渲染指令
 *  6) 强制数据绑定指令
 *  7) 双向数据绑定在表单中使用
 *  8) Vue中标签样式操作的两种方式:    style 和  class 
 * 4. Vue的面试题
 *  1) 请说说你对Vue的理解(请说说你对Vue的看法)
 *  2) Vue的优点
 *      1)	借鉴angular的模板和数据绑定技术
 *      2)	借鉴react的组件化和虚拟DOM技术
 *  3) 请说出Vue中常见的7个指令
 *  4) 双向数据绑定和双向数据流的理解(双向数据流在Vue课程结束后,面试精讲中进行讲解)
 *  5) 说说你对MVVM模式的理解(如果学过后台,可以顺便提一下MVC)
 *    MVVM:M--->Model,v--->view(DOM视图),vm--->Vue的实例(监听DOM和数据绑定操作)
 * 如果数据变化了,视图就会改变,改变视图,数据也会变化,就通过Vue来连接这种关系，也是一种方式,也是一种模式,MVVM模式
 *    MVC:M是指业务模型，V是指用户界面，C则是控制器，使用MVC的目的是将M和V的实现代码分离，从而使同一个程序可以使用不同的表现形式
 *  6) 组件化的理解(需要解析什么是组件,什么是组件化)
 *    组件:具有特定功能效果的集合
 * 
 * 
 * 模版:
 * 数据绑定:
 * 组件化:
 * 虚拟DOM:
 * 
 * 
 * 
 */